Sender: LSF System <lsfadmin@lng06>
Subject: Job 46185850: <ResNet34_KFold_4> in cluster <rcc> Exited

Job <ResNet34_KFold_4> was submitted from host <login-g> by user <rs619065> in cluster <rcc> at Wed Dec 12 10:56:09 2018
Job was executed on host(s) <lng06>, in queue <jara-clx>, as user <rs619065> in cluster <rcc> at Mon Dec 17 01:07:52 2018
</home/rs619065> was used as the home directory.
</home/rs619065/HPAIC/src> was used as the working directory.
Started at Mon Dec 17 01:07:52 2018
Terminated at Tue Dec 18 17:09:56 2018
Results reported at Tue Dec 18 17:09:56 2018

Your job looked like:

------------------------------------------------------------
# LSBATCH: User input
./train.zsh ResNet34 4
------------------------------------------------------------

TERM_OWNER: job killed by owner.
Exited with exit code 130.

Resource usage summary:

    CPU time :                                   549359.69 sec.
    Max Memory :                                 42509 MB
    Average Memory :                             38128.69 MB
    Total Requested Memory :                     102400.00 MB
    Delta Memory :                               59891.00 MB
    Max Swap :                                   2 MB
    Max Processes :                              39
    Max Threads :                                874
    Run time :                                   144123 sec.
    Turnaround time :                            540827 sec.

The output (if any) follows:

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
data (InputLayer)               (None, 1024, 1024, 3 0                                            
__________________________________________________________________________________________________
conv1_pad (ZeroPadding2D)       (None, 1030, 1030, 3 0           data[0][0]                       
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 512, 512, 64) 9472        conv1_pad[0][0]                  
__________________________________________________________________________________________________
bn_conv1 (BatchNormalization)   (None, 512, 512, 64) 256         conv1[0][0]                      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 512, 512, 64) 0           bn_conv1[0][0]                   
__________________________________________________________________________________________________
pool1_pad (ZeroPadding2D)       (None, 514, 514, 64) 0           activation_1[0][0]               
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 256, 256, 64) 0           pool1_pad[0][0]                  
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 256, 256, 64) 36928       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 256, 256, 64) 256         res2a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 256, 256, 64) 0           bn2a_branch2a[0][0]              
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 256, 256, 64) 36928       activation_2[0][0]               
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, 256, 256, 64) 36928       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 256, 256, 64) 256         res2a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 256, 256, 64) 0           bn2a_branch2b[0][0]              
__________________________________________________________________________________________________
bn2a_branch1 (BatchNormalizatio (None, 256, 256, 64) 256         res2a_branch1[0][0]              
__________________________________________________________________________________________________
add_1 (Add)                     (None, 256, 256, 64) 0           activation_3[0][0]               
                                                                 bn2a_branch1[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 256, 256, 64) 0           add_1[0][0]                      
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 256, 256, 64) 36928       activation_4[0][0]               
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 256, 256, 64) 256         res2b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 256, 256, 64) 0           bn2b_branch2a[0][0]              
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 256, 256, 64) 36928       activation_5[0][0]               
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 256, 256, 64) 256         res2b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 256, 256, 64) 0           bn2b_branch2b[0][0]              
__________________________________________________________________________________________________
add_2 (Add)                     (None, 256, 256, 64) 0           activation_6[0][0]               
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 256, 256, 64) 0           add_2[0][0]                      
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 256, 256, 64) 36928       activation_7[0][0]               
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 256, 256, 64) 256         res2c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 256, 256, 64) 0           bn2c_branch2a[0][0]              
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 256, 256, 64) 36928       activation_8[0][0]               
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 256, 256, 64) 256         res2c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 256, 256, 64) 0           bn2c_branch2b[0][0]              
__________________________________________________________________________________________________
add_3 (Add)                     (None, 256, 256, 64) 0           activation_9[0][0]               
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 256, 256, 64) 0           add_3[0][0]                      
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 128, 128, 128 73856       activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 128, 128, 128 512         res3a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 128, 128, 128 0           bn3a_branch2a[0][0]              
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 128, 128, 128 147584      activation_11[0][0]              
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 128, 128, 128 73856       activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 128, 128, 128 512         res3a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 128, 128, 128 0           bn3a_branch2b[0][0]              
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 128, 128, 128 512         res3a_branch1[0][0]              
__________________________________________________________________________________________________
add_4 (Add)                     (None, 128, 128, 128 0           activation_12[0][0]              
                                                                 bn3a_branch1[0][0]               
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 128, 128, 128 0           add_4[0][0]                      
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 128, 128, 128 147584      activation_13[0][0]              
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 128, 128, 128 512         res3b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 128, 128, 128 0           bn3b_branch2a[0][0]              
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 128, 128, 128 147584      activation_14[0][0]              
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 128, 128, 128 512         res3b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 128, 128, 128 0           bn3b_branch2b[0][0]              
__________________________________________________________________________________________________
add_5 (Add)                     (None, 128, 128, 128 0           activation_15[0][0]              
                                                                 activation_13[0][0]              
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 128, 128, 128 0           add_5[0][0]                      
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 128, 128, 128 147584      activation_16[0][0]              
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 128, 128, 128 512         res3c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 128, 128, 128 0           bn3c_branch2a[0][0]              
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 128, 128, 128 147584      activation_17[0][0]              
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 128, 128, 128 512         res3c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 128, 128, 128 0           bn3c_branch2b[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 128, 128, 128 0           activation_18[0][0]              
                                                                 activation_16[0][0]              
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 128, 128, 128 0           add_6[0][0]                      
__________________________________________________________________________________________________
res3d_branch2a (Conv2D)         (None, 128, 128, 128 147584      activation_19[0][0]              
__________________________________________________________________________________________________
bn3d_branch2a (BatchNormalizati (None, 128, 128, 128 512         res3d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 128, 128, 128 0           bn3d_branch2a[0][0]              
__________________________________________________________________________________________________
res3d_branch2b (Conv2D)         (None, 128, 128, 128 147584      activation_20[0][0]              
__________________________________________________________________________________________________
bn3d_branch2b (BatchNormalizati (None, 128, 128, 128 512         res3d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 128, 128, 128 0           bn3d_branch2b[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, 128, 128, 128 0           activation_21[0][0]              
                                                                 activation_19[0][0]              
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 128, 128, 128 0           add_7[0][0]                      
__________________________________________________________________________________________________
res4a_branch2a (Conv2D)         (None, 64, 64, 256)  295168      activation_22[0][0]              
__________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 64, 64, 256)  0           bn4a_branch2a[0][0]              
__________________________________________________________________________________________________
res4a_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_23[0][0]              
__________________________________________________________________________________________________
res4a_branch1 (Conv2D)          (None, 64, 64, 256)  295168      activation_22[0][0]              
__________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 64, 64, 256)  0           bn4a_branch2b[0][0]              
__________________________________________________________________________________________________
bn4a_branch1 (BatchNormalizatio (None, 64, 64, 256)  1024        res4a_branch1[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 64, 64, 256)  0           activation_24[0][0]              
                                                                 bn4a_branch1[0][0]               
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 64, 64, 256)  0           add_8[0][0]                      
__________________________________________________________________________________________________
res4b_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_25[0][0]              
__________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 64, 64, 256)  0           bn4b_branch2a[0][0]              
__________________________________________________________________________________________________
res4b_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_26[0][0]              
__________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 64, 64, 256)  0           bn4b_branch2b[0][0]              
__________________________________________________________________________________________________
add_9 (Add)                     (None, 64, 64, 256)  0           activation_27[0][0]              
                                                                 activation_25[0][0]              
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 64, 64, 256)  0           add_9[0][0]                      
__________________________________________________________________________________________________
res4c_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_28[0][0]              
__________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 64, 64, 256)  0           bn4c_branch2a[0][0]              
__________________________________________________________________________________________________
res4c_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_29[0][0]              
__________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 64, 64, 256)  0           bn4c_branch2b[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, 64, 64, 256)  0           activation_30[0][0]              
                                                                 activation_28[0][0]              
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 64, 64, 256)  0           add_10[0][0]                     
__________________________________________________________________________________________________
res4d_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_31[0][0]              
__________________________________________________________________________________________________
bn4d_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 64, 64, 256)  0           bn4d_branch2a[0][0]              
__________________________________________________________________________________________________
res4d_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_32[0][0]              
__________________________________________________________________________________________________
bn4d_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 64, 64, 256)  0           bn4d_branch2b[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, 64, 64, 256)  0           activation_33[0][0]              
                                                                 activation_31[0][0]              
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 64, 64, 256)  0           add_11[0][0]                     
__________________________________________________________________________________________________
res4e_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_34[0][0]              
__________________________________________________________________________________________________
bn4e_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4e_branch2a[0][0]             
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 64, 64, 256)  0           bn4e_branch2a[0][0]              
__________________________________________________________________________________________________
res4e_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_35[0][0]              
__________________________________________________________________________________________________
bn4e_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4e_branch2b[0][0]             
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 64, 64, 256)  0           bn4e_branch2b[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, 64, 64, 256)  0           activation_36[0][0]              
                                                                 activation_34[0][0]              
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 64, 64, 256)  0           add_12[0][0]                     
__________________________________________________________________________________________________
res4f_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_37[0][0]              
__________________________________________________________________________________________________
bn4f_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4f_branch2a[0][0]             
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 64, 64, 256)  0           bn4f_branch2a[0][0]              
__________________________________________________________________________________________________
res4f_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_38[0][0]              
__________________________________________________________________________________________________
bn4f_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4f_branch2b[0][0]             
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 64, 64, 256)  0           bn4f_branch2b[0][0]              
__________________________________________________________________________________________________
add_13 (Add)                    (None, 64, 64, 256)  0           activation_39[0][0]              
                                                                 activation_37[0][0]              
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 64, 64, 256)  0           add_13[0][0]                     
__________________________________________________________________________________________________
res5a_branch2a (Conv2D)         (None, 32, 32, 512)  1180160     activation_40[0][0]              
__________________________________________________________________________________________________
bn5a_branch2a (BatchNormalizati (None, 32, 32, 512)  2048        res5a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 32, 32, 512)  0           bn5a_branch2a[0][0]              
__________________________________________________________________________________________________
res5a_branch2b (Conv2D)         (None, 32, 32, 512)  2359808     activation_41[0][0]              
__________________________________________________________________________________________________
res5a_branch1 (Conv2D)          (None, 32, 32, 512)  1180160     activation_40[0][0]              
__________________________________________________________________________________________________
bn5a_branch2b (BatchNormalizati (None, 32, 32, 512)  2048        res5a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_42 (Activation)      (None, 32, 32, 512)  0           bn5a_branch2b[0][0]              
__________________________________________________________________________________________________
bn5a_branch1 (BatchNormalizatio (None, 32, 32, 512)  2048        res5a_branch1[0][0]              
__________________________________________________________________________________________________
add_14 (Add)                    (None, 32, 32, 512)  0           activation_42[0][0]              
                                                                 bn5a_branch1[0][0]               
__________________________________________________________________________________________________
activation_43 (Activation)      (None, 32, 32, 512)  0           add_14[0][0]                     
__________________________________________________________________________________________________
res5b_branch2a (Conv2D)         (None, 32, 32, 512)  2359808     activation_43[0][0]              
__________________________________________________________________________________________________
bn5b_branch2a (BatchNormalizati (None, 32, 32, 512)  2048        res5b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_44 (Activation)      (None, 32, 32, 512)  0           bn5b_branch2a[0][0]              
__________________________________________________________________________________________________
res5b_branch2b (Conv2D)         (None, 32, 32, 512)  2359808     activation_44[0][0]              
__________________________________________________________________________________________________
bn5b_branch2b (BatchNormalizati (None, 32, 32, 512)  2048        res5b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_45 (Activation)      (None, 32, 32, 512)  0           bn5b_branch2b[0][0]              
__________________________________________________________________________________________________
add_15 (Add)                    (None, 32, 32, 512)  0           activation_45[0][0]              
                                                                 activation_43[0][0]              
__________________________________________________________________________________________________
activation_46 (Activation)      (None, 32, 32, 512)  0           add_15[0][0]                     
__________________________________________________________________________________________________
res5c_branch2a (Conv2D)         (None, 32, 32, 512)  2359808     activation_46[0][0]              
__________________________________________________________________________________________________
bn5c_branch2a (BatchNormalizati (None, 32, 32, 512)  2048        res5c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_47 (Activation)      (None, 32, 32, 512)  0           bn5c_branch2a[0][0]              
__________________________________________________________________________________________________
res5c_branch2b (Conv2D)         (None, 32, 32, 512)  2359808     activation_47[0][0]              
__________________________________________________________________________________________________
bn5c_branch2b (BatchNormalizati (None, 32, 32, 512)  2048        res5c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_48 (Activation)      (None, 32, 32, 512)  0           bn5c_branch2b[0][0]              
__________________________________________________________________________________________________
add_16 (Add)                    (None, 32, 32, 512)  0           activation_48[0][0]              
                                                                 activation_46[0][0]              
__________________________________________________________________________________________________
activation_49 (Activation)      (None, 32, 32, 512)  0           add_16[0][0]                     
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 64)           0           res2a_branch1[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_3 (Glo (None, 128)          0           res3a_branch1[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_4 (Glo (None, 256)          0           res4a_branch1[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_5 (Glo (None, 512)          0           res5a_branch1[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 512)          0           activation_49[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1472)         0           global_average_pooling2d_2[0][0] 
                                                                 global_average_pooling2d_3[0][0] 
                                                                 global_average_pooling2d_4[0][0] 
                                                                 global_average_pooling2d_5[0][0] 
                                                                 global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
fc1 (Dense)                     (None, 512)          754176      concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_1 (BatchNormalization)    (None, 512)          2048        fc1[0][0]                        
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512)          0           batch_1[0][0]                    
__________________________________________________________________________________________________
fc2 (Dense)                     (None, 512)          262656      dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_2 (BatchNormalization)    (None, 512)          2048        fc2[0][0]                        
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 512)          0           batch_2[0][0]                    
__________________________________________________________________________________________________
fc28 (Dense)                    (None, 28)           14364       dropout_2[0][0]                  
==================================================================================================
Total params: 23,758,940
Trainable params: 23,739,740
Non-trainable params: 19,200
__________________________________________________________________________________________________
Training model on 84572 samples, validate on 21105 samples
Epoch 1/100
 - 5698s - loss: 0.3242 - binary_accuracy: 0.8672 - val_loss: 0.1508 - val_binary_accuracy: 0.9510

Epoch 00001: val_loss improved from inf to 0.15075122, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 2/100
 - 7156s - loss: 0.1567 - binary_accuracy: 0.9497 - val_loss: 0.1422 - val_binary_accuracy: 0.9548

Epoch 00002: val_loss improved from 0.15075122 to 0.14217054, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 3/100
 - 5889s - loss: 0.1404 - binary_accuracy: 0.9543 - val_loss: 0.1351 - val_binary_accuracy: 0.9537

Epoch 00003: val_loss improved from 0.14217054 to 0.13505370, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 4/100
 - 5969s - loss: 0.1279 - binary_accuracy: 0.9579 - val_loss: 0.1306 - val_binary_accuracy: 0.9575

Epoch 00004: val_loss improved from 0.13505370 to 0.13057765, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 5/100
 - 5850s - loss: 0.1216 - binary_accuracy: 0.9599 - val_loss: 0.1249 - val_binary_accuracy: 0.9598

Epoch 00005: val_loss improved from 0.13057765 to 0.12487476, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 6/100
 - 5888s - loss: 0.1166 - binary_accuracy: 0.9613 - val_loss: 0.1226 - val_binary_accuracy: 0.9611

Epoch 00006: val_loss improved from 0.12487476 to 0.12262390, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 7/100
 - 5914s - loss: 0.1136 - binary_accuracy: 0.9620 - val_loss: 0.1248 - val_binary_accuracy: 0.9589

Epoch 00007: val_loss did not improve from 0.12262390
Epoch 8/100
 - 6045s - loss: 0.1110 - binary_accuracy: 0.9628 - val_loss: 0.1075 - val_binary_accuracy: 0.9634

Epoch 00008: val_loss improved from 0.12262390 to 0.10750091, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 9/100
 - 7121s - loss: 0.1088 - binary_accuracy: 0.9635 - val_loss: 0.1128 - val_binary_accuracy: 0.9636

Epoch 00009: val_loss did not improve from 0.10750091
Epoch 10/100
 - 6043s - loss: 0.1069 - binary_accuracy: 0.9641 - val_loss: 0.1031 - val_binary_accuracy: 0.9655

Epoch 00010: val_loss improved from 0.10750091 to 0.10313823, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 11/100
 - 6115s - loss: 0.1055 - binary_accuracy: 0.9645 - val_loss: 0.1064 - val_binary_accuracy: 0.9649

Epoch 00011: val_loss did not improve from 0.10313823
Epoch 12/100
 - 6541s - loss: 0.1046 - binary_accuracy: 0.9648 - val_loss: 0.1037 - val_binary_accuracy: 0.9646

Epoch 00012: val_loss did not improve from 0.10313823
Epoch 13/100
 - 6070s - loss: 0.1035 - binary_accuracy: 0.9652 - val_loss: 0.1091 - val_binary_accuracy: 0.9654

Epoch 00013: val_loss did not improve from 0.10313823
Epoch 14/100
 - 6321s - loss: 0.1028 - binary_accuracy: 0.9654 - val_loss: 0.1112 - val_binary_accuracy: 0.9644

Epoch 00014: val_loss did not improve from 0.10313823
Epoch 15/100
 - 6308s - loss: 0.1020 - binary_accuracy: 0.9657 - val_loss: 0.1031 - val_binary_accuracy: 0.9643

Epoch 00015: val_loss improved from 0.10313823 to 0.10311052, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 16/100
 - 6219s - loss: 0.1012 - binary_accuracy: 0.9660 - val_loss: 0.1071 - val_binary_accuracy: 0.9656

Epoch 00016: val_loss did not improve from 0.10311052
Epoch 17/100
 - 5925s - loss: 0.1006 - binary_accuracy: 0.9661 - val_loss: 0.1034 - val_binary_accuracy: 0.9660

Epoch 00017: val_loss did not improve from 0.10311052
Epoch 18/100
 - 5979s - loss: 0.0999 - binary_accuracy: 0.9665 - val_loss: 0.1090 - val_binary_accuracy: 0.9643

Epoch 00018: val_loss did not improve from 0.10311052
Epoch 19/100
 - 5975s - loss: 0.0992 - binary_accuracy: 0.9666 - val_loss: 0.0982 - val_binary_accuracy: 0.9681

Epoch 00019: val_loss improved from 0.10311052 to 0.09823114, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 20/100

Epoch 00019: val_loss improved from 0.10311052 to 0.09823114, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
 - 6007s - loss: 0.0989 - binary_accuracy: 0.9667 - val_loss: 0.1020 - val_binary_accuracy: 0.9644

Epoch 00020: val_loss did not improve from 0.09823114
Epoch 21/100
 - 5961s - loss: 0.0983 - binary_accuracy: 0.9670 - val_loss: 0.1017 - val_binary_accuracy: 0.9655

Epoch 00021: val_loss did not improve from 0.09823114
Epoch 22/100
 - 5984s - loss: 0.0981 - binary_accuracy: 0.9671 - val_loss: 0.0983 - val_binary_accuracy: 0.9675

Epoch 00022: val_loss did not improve from 0.09823114
Epoch 23/100
 - 5947s - loss: 0.0977 - binary_accuracy: 0.9672 - val_loss: 0.0968 - val_binary_accuracy: 0.9675

Epoch 00023: val_loss improved from 0.09823114 to 0.09677458, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 24/100


PS:

Read file <./cluster_err/ResNet34_KFold_4_err.txt> for stderr output of this job.

Sender: LSF System <lsfadmin@lng04>
Subject: Job 46244558: <ResNet34_KFold_4> in cluster <rcc> Done

Job <ResNet34_KFold_4> was submitted from host <login-g> by user <rs619065> in cluster <rcc> at Thu Dec 20 16:14:17 2018
Job was executed on host(s) <lng04>, in queue <jara-clx>, as user <rs619065> in cluster <rcc> at Thu Dec 20 17:04:59 2018
</home/rs619065> was used as the home directory.
</home/rs619065/HPAIC/src> was used as the working directory.
Started at Thu Dec 20 17:04:59 2018
Terminated at Fri Dec 21 11:03:14 2018
Results reported at Fri Dec 21 11:03:14 2018

Your job looked like:

------------------------------------------------------------
# LSBATCH: User input
./train.zsh ResNet34 4
------------------------------------------------------------

Successfully completed.

Resource usage summary:

    CPU time :                                   170583.47 sec.
    Max Memory :                                 38916 MB
    Average Memory :                             32159.52 MB
    Total Requested Memory :                     60000.00 MB
    Delta Memory :                               21084.00 MB
    Max Swap :                                   2 MB
    Max Processes :                              21
    Max Threads :                                473
    Run time :                                   64695 sec.
    Turnaround time :                            67737 sec.

The output (if any) follows:

Training model on 84572 samples, validate on 21105 samples
Epoch 1/10
Epoch 1/10
 - 7201s - loss: 0.0891 - binary_accuracy: 0.9697 - val_loss: 0.0907 - val_binary_accuracy: 0.9697

Epoch 00001: val_loss improved from 0.09677458 to 0.09065528, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 2/10
 - 6963s - loss: 0.0879 - binary_accuracy: 0.9701 - val_loss: 0.0887 - val_binary_accuracy: 0.9699

Epoch 00002: val_loss improved from 0.09065528 to 0.08865113, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 3/10
 - 6622s - loss: 0.0875 - binary_accuracy: 0.9702 - val_loss: 0.0874 - val_binary_accuracy: 0.9705

Epoch 00003: val_loss improved from 0.08865113 to 0.08742385, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 4/10
 - 6549s - loss: 0.0868 - binary_accuracy: 0.9704 - val_loss: 0.0883 - val_binary_accuracy: 0.9695

Epoch 00004: val_loss did not improve from 0.08742385
Epoch 5/10
 - 4851s - loss: 0.0866 - binary_accuracy: 0.9706 - val_loss: 0.0892 - val_binary_accuracy: 0.9686

Epoch 00005: val_loss did not improve from 0.08742385
Epoch 6/10
 - 6170s - loss: 0.0861 - binary_accuracy: 0.9708 - val_loss: 0.0863 - val_binary_accuracy: 0.9707

Epoch 00006: val_loss improved from 0.08742385 to 0.08628063, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 7/10
 - 6699s - loss: 0.0857 - binary_accuracy: 0.9709 - val_loss: 0.0902 - val_binary_accuracy: 0.9700

Epoch 00007: val_loss did not improve from 0.08628063
Epoch 8/10
 - 6470s - loss: 0.0853 - binary_accuracy: 0.9710 - val_loss: 0.0893 - val_binary_accuracy: 0.9703

Epoch 00008: val_loss did not improve from 0.08628063
Epoch 9/10
 - 6496s - loss: 0.0850 - binary_accuracy: 0.9711 - val_loss: 0.0860 - val_binary_accuracy: 0.9707

Epoch 00009: val_loss improved from 0.08628063 to 0.08603570, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_4.h5
Epoch 10/10
 - 6541s - loss: 0.0846 - binary_accuracy: 0.9713 - val_loss: 0.0881 - val_binary_accuracy: 0.9703

Epoch 00010: val_loss did not improve from 0.08603570
complete!!


PS:

Read file <./cluster_err/ResNet34_KFold_4_err.txt> for stderr output of this job.

