Sender: LSF System <lsfadmin@lng04>
Subject: Job 46185847: <ResNet34_KFold_1> in cluster <rcc> Exited

Job <ResNet34_KFold_1> was submitted from host <login-g> by user <rs619065> in cluster <rcc> at Wed Dec 12 10:56:09 2018
Job was executed on host(s) <lng04>, in queue <jara-clx>, as user <rs619065> in cluster <rcc> at Sun Dec 16 16:16:37 2018
</home/rs619065> was used as the home directory.
</home/rs619065/HPAIC/src> was used as the working directory.
Started at Sun Dec 16 16:16:37 2018
Terminated at Tue Dec 18 17:07:17 2018
Results reported at Tue Dec 18 17:07:17 2018

Your job looked like:

------------------------------------------------------------
# LSBATCH: User input
./train.zsh ResNet34 1
------------------------------------------------------------

TERM_OWNER: job killed by owner.
Exited with exit code 143.

Resource usage summary:

    CPU time :                                   683397.00 sec.
    Max Memory :                                 43409 MB
    Average Memory :                             39482.46 MB
    Total Requested Memory :                     102400.00 MB
    Delta Memory :                               58991.00 MB
    Max Swap :                                   2 MB
    Max Processes :                              37
    Max Threads :                                873
    Run time :                                   175840 sec.
    Turnaround time :                            540668 sec.

The output (if any) follows:

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
data (InputLayer)               (None, 1024, 1024, 3 0                                            
__________________________________________________________________________________________________
conv1_pad (ZeroPadding2D)       (None, 1030, 1030, 3 0           data[0][0]                       
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 512, 512, 64) 9472        conv1_pad[0][0]                  
__________________________________________________________________________________________________
bn_conv1 (BatchNormalization)   (None, 512, 512, 64) 256         conv1[0][0]                      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 512, 512, 64) 0           bn_conv1[0][0]                   
__________________________________________________________________________________________________
pool1_pad (ZeroPadding2D)       (None, 514, 514, 64) 0           activation_1[0][0]               
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 256, 256, 64) 0           pool1_pad[0][0]                  
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 256, 256, 64) 36928       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 256, 256, 64) 256         res2a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 256, 256, 64) 0           bn2a_branch2a[0][0]              
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 256, 256, 64) 36928       activation_2[0][0]               
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, 256, 256, 64) 36928       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 256, 256, 64) 256         res2a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 256, 256, 64) 0           bn2a_branch2b[0][0]              
__________________________________________________________________________________________________
bn2a_branch1 (BatchNormalizatio (None, 256, 256, 64) 256         res2a_branch1[0][0]              
__________________________________________________________________________________________________
add_1 (Add)                     (None, 256, 256, 64) 0           activation_3[0][0]               
                                                                 bn2a_branch1[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 256, 256, 64) 0           add_1[0][0]                      
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 256, 256, 64) 36928       activation_4[0][0]               
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 256, 256, 64) 256         res2b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 256, 256, 64) 0           bn2b_branch2a[0][0]              
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 256, 256, 64) 36928       activation_5[0][0]               
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 256, 256, 64) 256         res2b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 256, 256, 64) 0           bn2b_branch2b[0][0]              
__________________________________________________________________________________________________
add_2 (Add)                     (None, 256, 256, 64) 0           activation_6[0][0]               
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 256, 256, 64) 0           add_2[0][0]                      
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 256, 256, 64) 36928       activation_7[0][0]               
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 256, 256, 64) 256         res2c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 256, 256, 64) 0           bn2c_branch2a[0][0]              
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 256, 256, 64) 36928       activation_8[0][0]               
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 256, 256, 64) 256         res2c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 256, 256, 64) 0           bn2c_branch2b[0][0]              
__________________________________________________________________________________________________
add_3 (Add)                     (None, 256, 256, 64) 0           activation_9[0][0]               
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 256, 256, 64) 0           add_3[0][0]                      
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 128, 128, 128 73856       activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 128, 128, 128 512         res3a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 128, 128, 128 0           bn3a_branch2a[0][0]              
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 128, 128, 128 147584      activation_11[0][0]              
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 128, 128, 128 73856       activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 128, 128, 128 512         res3a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 128, 128, 128 0           bn3a_branch2b[0][0]              
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 128, 128, 128 512         res3a_branch1[0][0]              
__________________________________________________________________________________________________
add_4 (Add)                     (None, 128, 128, 128 0           activation_12[0][0]              
                                                                 bn3a_branch1[0][0]               
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 128, 128, 128 0           add_4[0][0]                      
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 128, 128, 128 147584      activation_13[0][0]              
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 128, 128, 128 512         res3b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 128, 128, 128 0           bn3b_branch2a[0][0]              
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 128, 128, 128 147584      activation_14[0][0]              
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 128, 128, 128 512         res3b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 128, 128, 128 0           bn3b_branch2b[0][0]              
__________________________________________________________________________________________________
add_5 (Add)                     (None, 128, 128, 128 0           activation_15[0][0]              
                                                                 activation_13[0][0]              
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 128, 128, 128 0           add_5[0][0]                      
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 128, 128, 128 147584      activation_16[0][0]              
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 128, 128, 128 512         res3c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 128, 128, 128 0           bn3c_branch2a[0][0]              
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 128, 128, 128 147584      activation_17[0][0]              
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 128, 128, 128 512         res3c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 128, 128, 128 0           bn3c_branch2b[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 128, 128, 128 0           activation_18[0][0]              
                                                                 activation_16[0][0]              
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 128, 128, 128 0           add_6[0][0]                      
__________________________________________________________________________________________________
res3d_branch2a (Conv2D)         (None, 128, 128, 128 147584      activation_19[0][0]              
__________________________________________________________________________________________________
bn3d_branch2a (BatchNormalizati (None, 128, 128, 128 512         res3d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 128, 128, 128 0           bn3d_branch2a[0][0]              
__________________________________________________________________________________________________
res3d_branch2b (Conv2D)         (None, 128, 128, 128 147584      activation_20[0][0]              
__________________________________________________________________________________________________
bn3d_branch2b (BatchNormalizati (None, 128, 128, 128 512         res3d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 128, 128, 128 0           bn3d_branch2b[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, 128, 128, 128 0           activation_21[0][0]              
                                                                 activation_19[0][0]              
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 128, 128, 128 0           add_7[0][0]                      
__________________________________________________________________________________________________
res4a_branch2a (Conv2D)         (None, 64, 64, 256)  295168      activation_22[0][0]              
__________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 64, 64, 256)  0           bn4a_branch2a[0][0]              
__________________________________________________________________________________________________
res4a_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_23[0][0]              
__________________________________________________________________________________________________
res4a_branch1 (Conv2D)          (None, 64, 64, 256)  295168      activation_22[0][0]              
__________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 64, 64, 256)  0           bn4a_branch2b[0][0]              
__________________________________________________________________________________________________
bn4a_branch1 (BatchNormalizatio (None, 64, 64, 256)  1024        res4a_branch1[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 64, 64, 256)  0           activation_24[0][0]              
                                                                 bn4a_branch1[0][0]               
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 64, 64, 256)  0           add_8[0][0]                      
__________________________________________________________________________________________________
res4b_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_25[0][0]              
__________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 64, 64, 256)  0           bn4b_branch2a[0][0]              
__________________________________________________________________________________________________
res4b_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_26[0][0]              
__________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 64, 64, 256)  0           bn4b_branch2b[0][0]              
__________________________________________________________________________________________________
add_9 (Add)                     (None, 64, 64, 256)  0           activation_27[0][0]              
                                                                 activation_25[0][0]              
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 64, 64, 256)  0           add_9[0][0]                      
__________________________________________________________________________________________________
res4c_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_28[0][0]              
__________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 64, 64, 256)  0           bn4c_branch2a[0][0]              
__________________________________________________________________________________________________
res4c_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_29[0][0]              
__________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 64, 64, 256)  0           bn4c_branch2b[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, 64, 64, 256)  0           activation_30[0][0]              
                                                                 activation_28[0][0]              
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 64, 64, 256)  0           add_10[0][0]                     
__________________________________________________________________________________________________
res4d_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_31[0][0]              
__________________________________________________________________________________________________
bn4d_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 64, 64, 256)  0           bn4d_branch2a[0][0]              
__________________________________________________________________________________________________
res4d_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_32[0][0]              
__________________________________________________________________________________________________
bn4d_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 64, 64, 256)  0           bn4d_branch2b[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, 64, 64, 256)  0           activation_33[0][0]              
                                                                 activation_31[0][0]              
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 64, 64, 256)  0           add_11[0][0]                     
__________________________________________________________________________________________________
res4e_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_34[0][0]              
__________________________________________________________________________________________________
bn4e_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4e_branch2a[0][0]             
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 64, 64, 256)  0           bn4e_branch2a[0][0]              
__________________________________________________________________________________________________
res4e_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_35[0][0]              
__________________________________________________________________________________________________
bn4e_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4e_branch2b[0][0]             
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 64, 64, 256)  0           bn4e_branch2b[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, 64, 64, 256)  0           activation_36[0][0]              
                                                                 activation_34[0][0]              
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 64, 64, 256)  0           add_12[0][0]                     
__________________________________________________________________________________________________
res4f_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_37[0][0]              
__________________________________________________________________________________________________
bn4f_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4f_branch2a[0][0]             
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 64, 64, 256)  0           bn4f_branch2a[0][0]              
__________________________________________________________________________________________________
res4f_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_38[0][0]              
__________________________________________________________________________________________________
bn4f_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4f_branch2b[0][0]             
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 64, 64, 256)  0           bn4f_branch2b[0][0]              
__________________________________________________________________________________________________
add_13 (Add)                    (None, 64, 64, 256)  0           activation_39[0][0]              
                                                                 activation_37[0][0]              
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 64, 64, 256)  0           add_13[0][0]                     
__________________________________________________________________________________________________
res5a_branch2a (Conv2D)         (None, 32, 32, 512)  1180160     activation_40[0][0]              
__________________________________________________________________________________________________
bn5a_branch2a (BatchNormalizati (None, 32, 32, 512)  2048        res5a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 32, 32, 512)  0           bn5a_branch2a[0][0]              
__________________________________________________________________________________________________
res5a_branch2b (Conv2D)         (None, 32, 32, 512)  2359808     activation_41[0][0]              
__________________________________________________________________________________________________
res5a_branch1 (Conv2D)          (None, 32, 32, 512)  1180160     activation_40[0][0]              
__________________________________________________________________________________________________
bn5a_branch2b (BatchNormalizati (None, 32, 32, 512)  2048        res5a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_42 (Activation)      (None, 32, 32, 512)  0           bn5a_branch2b[0][0]              
__________________________________________________________________________________________________
bn5a_branch1 (BatchNormalizatio (None, 32, 32, 512)  2048        res5a_branch1[0][0]              
__________________________________________________________________________________________________
add_14 (Add)                    (None, 32, 32, 512)  0           activation_42[0][0]              
                                                                 bn5a_branch1[0][0]               
__________________________________________________________________________________________________
activation_43 (Activation)      (None, 32, 32, 512)  0           add_14[0][0]                     
__________________________________________________________________________________________________
res5b_branch2a (Conv2D)         (None, 32, 32, 512)  2359808     activation_43[0][0]              
__________________________________________________________________________________________________
bn5b_branch2a (BatchNormalizati (None, 32, 32, 512)  2048        res5b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_44 (Activation)      (None, 32, 32, 512)  0           bn5b_branch2a[0][0]              
__________________________________________________________________________________________________
res5b_branch2b (Conv2D)         (None, 32, 32, 512)  2359808     activation_44[0][0]              
__________________________________________________________________________________________________
bn5b_branch2b (BatchNormalizati (None, 32, 32, 512)  2048        res5b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_45 (Activation)      (None, 32, 32, 512)  0           bn5b_branch2b[0][0]              
__________________________________________________________________________________________________
add_15 (Add)                    (None, 32, 32, 512)  0           activation_45[0][0]              
                                                                 activation_43[0][0]              
__________________________________________________________________________________________________
activation_46 (Activation)      (None, 32, 32, 512)  0           add_15[0][0]                     
__________________________________________________________________________________________________
res5c_branch2a (Conv2D)         (None, 32, 32, 512)  2359808     activation_46[0][0]              
__________________________________________________________________________________________________
bn5c_branch2a (BatchNormalizati (None, 32, 32, 512)  2048        res5c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_47 (Activation)      (None, 32, 32, 512)  0           bn5c_branch2a[0][0]              
__________________________________________________________________________________________________
res5c_branch2b (Conv2D)         (None, 32, 32, 512)  2359808     activation_47[0][0]              
__________________________________________________________________________________________________
bn5c_branch2b (BatchNormalizati (None, 32, 32, 512)  2048        res5c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_48 (Activation)      (None, 32, 32, 512)  0           bn5c_branch2b[0][0]              
__________________________________________________________________________________________________
add_16 (Add)                    (None, 32, 32, 512)  0           activation_48[0][0]              
                                                                 activation_46[0][0]              
__________________________________________________________________________________________________
activation_49 (Activation)      (None, 32, 32, 512)  0           add_16[0][0]                     
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 64)           0           res2a_branch1[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_3 (Glo (None, 128)          0           res3a_branch1[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_4 (Glo (None, 256)          0           res4a_branch1[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_5 (Glo (None, 512)          0           res5a_branch1[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 512)          0           activation_49[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1472)         0           global_average_pooling2d_2[0][0] 
                                                                 global_average_pooling2d_3[0][0] 
                                                                 global_average_pooling2d_4[0][0] 
                                                                 global_average_pooling2d_5[0][0] 
                                                                 global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
fc1 (Dense)                     (None, 512)          754176      concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_1 (BatchNormalization)    (None, 512)          2048        fc1[0][0]                        
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512)          0           batch_1[0][0]                    
__________________________________________________________________________________________________
fc2 (Dense)                     (None, 512)          262656      dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_2 (BatchNormalization)    (None, 512)          2048        fc2[0][0]                        
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 512)          0           batch_2[0][0]                    
__________________________________________________________________________________________________
fc28 (Dense)                    (None, 28)           14364       dropout_2[0][0]                  
==================================================================================================
Total params: 23,758,940
Trainable params: 23,739,740
Non-trainable params: 19,200
__________________________________________________________________________________________________
Training model on 84546 samples, validate on 21131 samples
Epoch 1/100
 - 4722s - loss: 0.3225 - binary_accuracy: 0.8671 - val_loss: 0.2382 - val_binary_accuracy: 0.9424

Epoch 00001: val_loss improved from inf to 0.23824737, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 2/100
 - 6056s - loss: 0.1546 - binary_accuracy: 0.9499 - val_loss: 0.1695 - val_binary_accuracy: 0.9525

Epoch 00002: val_loss improved from 0.23824737 to 0.16952999, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 3/100
 - 5223s - loss: 0.1376 - binary_accuracy: 0.9548 - val_loss: 0.1262 - val_binary_accuracy: 0.9582

Epoch 00003: val_loss improved from 0.16952999 to 0.12618897, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 4/100
 - 5702s - loss: 0.1276 - binary_accuracy: 0.9579 - val_loss: 0.1275 - val_binary_accuracy: 0.9608

Epoch 00004: val_loss did not improve from 0.12618897
Epoch 5/100
 - 5827s - loss: 0.1208 - binary_accuracy: 0.9600 - val_loss: 0.1772 - val_binary_accuracy: 0.9475

Epoch 00005: val_loss did not improve from 0.12618897
Epoch 6/100
 - 5777s - loss: 0.1162 - binary_accuracy: 0.9613 - val_loss: 0.1153 - val_binary_accuracy: 0.9626

Epoch 00006: val_loss improved from 0.12618897 to 0.11528201, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 7/100
 - 7293s - loss: 0.1135 - binary_accuracy: 0.9619 - val_loss: 0.1181 - val_binary_accuracy: 0.9616

Epoch 00007: val_loss did not improve from 0.11528201
Epoch 8/100
 - 5810s - loss: 0.1108 - binary_accuracy: 0.9627 - val_loss: 0.1040 - val_binary_accuracy: 0.9645

Epoch 00008: val_loss improved from 0.11528201 to 0.10400477, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 9/100
 - 5758s - loss: 0.1085 - binary_accuracy: 0.9635 - val_loss: 0.1094 - val_binary_accuracy: 0.9638

Epoch 00009: val_loss did not improve from 0.10400477
Epoch 10/100
 - 5995s - loss: 0.1068 - binary_accuracy: 0.9640 - val_loss: 0.1133 - val_binary_accuracy: 0.9623

Epoch 00010: val_loss did not improve from 0.10400477
Epoch 11/100
 - 5908s - loss: 0.1057 - binary_accuracy: 0.9645 - val_loss: 0.1149 - val_binary_accuracy: 0.9633

Epoch 00011: val_loss did not improve from 0.10400477
Epoch 12/100
 - 5838s - loss: 0.1045 - binary_accuracy: 0.9648 - val_loss: 0.1021 - val_binary_accuracy: 0.9664

Epoch 00012: val_loss improved from 0.10400477 to 0.10209831, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 13/100
 - 5954s - loss: 0.1036 - binary_accuracy: 0.9651 - val_loss: 0.0983 - val_binary_accuracy: 0.9670

Epoch 00013: val_loss improved from 0.10209831 to 0.09830257, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 14/100
 - 6424s - loss: 0.1027 - binary_accuracy: 0.9653 - val_loss: 0.1047 - val_binary_accuracy: 0.9645

Epoch 00014: val_loss did not improve from 0.09830257
Epoch 15/100
 - 6246s - loss: 0.1021 - binary_accuracy: 0.9656 - val_loss: 0.1027 - val_binary_accuracy: 0.9674

Epoch 00015: val_loss did not improve from 0.09830257
Epoch 16/100
 - 6291s - loss: 0.1015 - binary_accuracy: 0.9659 - val_loss: 0.0994 - val_binary_accuracy: 0.9656

Epoch 00016: val_loss did not improve from 0.09830257
Epoch 17/100
 - 6118s - loss: 0.1005 - binary_accuracy: 0.9662 - val_loss: 0.1086 - val_binary_accuracy: 0.9639

Epoch 00017: val_loss did not improve from 0.09830257
Epoch 18/100
 - 6349s - loss: 0.1003 - binary_accuracy: 0.9662 - val_loss: 0.1061 - val_binary_accuracy: 0.9647

Epoch 00018: val_loss did not improve from 0.09830257
Epoch 19/100
 - 5956s - loss: 0.0996 - binary_accuracy: 0.9666 - val_loss: 0.1066 - val_binary_accuracy: 0.9626

Epoch 00019: val_loss did not improve from 0.09830257
Epoch 20/100
 - 6032s - loss: 0.0993 - binary_accuracy: 0.9666 - val_loss: 0.1069 - val_binary_accuracy: 0.9632

Epoch 00020: val_loss did not improve from 0.09830257
Epoch 21/100
 - 6397s - loss: 0.0986 - binary_accuracy: 0.9668 - val_loss: 0.1022 - val_binary_accuracy: 0.9668

Epoch 00021: val_loss did not improve from 0.09830257
Epoch 22/100
 - 5893s - loss: 0.0982 - binary_accuracy: 0.9670 - val_loss: 0.0948 - val_binary_accuracy: 0.9682

Epoch 00022: val_loss improved from 0.09830257 to 0.09483521, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 23/100
 - 6043s - loss: 0.0981 - binary_accuracy: 0.9671 - val_loss: 0.1016 - val_binary_accuracy: 0.9664

Epoch 00023: val_loss did not improve from 0.09483521
Epoch 24/100
 - 5935s - loss: 0.0975 - binary_accuracy: 0.9673 - val_loss: 0.1097 - val_binary_accuracy: 0.9635

Epoch 00024: val_loss did not improve from 0.09483521
Epoch 25/100
 - 6114s - loss: 0.0970 - binary_accuracy: 0.9674 - val_loss: 0.1038 - val_binary_accuracy: 0.9660

Epoch 00025: val_loss did not improve from 0.09483521
Epoch 26/100
 - 5903s - loss: 0.0967 - binary_accuracy: 0.9675 - val_loss: 0.0987 - val_binary_accuracy: 0.9673

Epoch 00026: val_loss did not improve from 0.09483521
Epoch 27/100
 - 5910s - loss: 0.0963 - binary_accuracy: 0.9677 - val_loss: 0.0984 - val_binary_accuracy: 0.9676

Epoch 00027: val_loss did not improve from 0.09483521
Epoch 28/100
 - 5925s - loss: 0.0961 - binary_accuracy: 0.9677 - val_loss: 0.0988 - val_binary_accuracy: 0.9665

Epoch 00028: val_loss did not improve from 0.09483521
Epoch 29/100
 - 5908s - loss: 0.0960 - binary_accuracy: 0.9678 - val_loss: 0.0953 - val_binary_accuracy: 0.9693

Epoch 00029: val_loss did not improve from 0.09483521
Epoch 30/100


PS:

Read file <./cluster_err/ResNet34_KFold_1_err.txt> for stderr output of this job.

Sender: LSF System <lsfadmin@lng05>
Subject: Job 46244561: <ResNet34_KFold_1> in cluster <rcc> Exited

Job <ResNet34_KFold_1> was submitted from host <login-g> by user <rs619065> in cluster <rcc> at Thu Dec 20 16:14:18 2018
Job was executed on host(s) <lng05>, in queue <jara-clx>, as user <rs619065> in cluster <rcc> at Thu Dec 20 18:18:50 2018
</home/rs619065> was used as the home directory.
</home/rs619065/HPAIC/src> was used as the working directory.
Started at Thu Dec 20 18:18:50 2018
Terminated at Fri Dec 21 11:53:13 2018
Results reported at Fri Dec 21 11:53:13 2018

Your job looked like:

------------------------------------------------------------
# LSBATCH: User input
./train.zsh ResNet34 1
------------------------------------------------------------

TERM_OWNER: job killed by owner.
Exited with exit code 130.

Resource usage summary:

    CPU time :                                   183168.42 sec.
    Max Memory :                                 38960 MB
    Average Memory :                             31791.70 MB
    Total Requested Memory :                     60000.00 MB
    Delta Memory :                               21040.00 MB
    Max Swap :                                   2 MB
    Max Processes :                              21
    Max Threads :                                473
    Run time :                                   63263 sec.
    Turnaround time :                            70735 sec.

The output (if any) follows:

Training model on 84546 samples, validate on 21131 samples
Epoch 1/10
Epoch 1/10
 - 6965s - loss: 0.0898 - binary_accuracy: 0.9694 - val_loss: 0.0925 - val_binary_accuracy: 0.9689

Epoch 00001: val_loss improved from 0.09483521 to 0.09251771, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 2/10
 - 7277s - loss: 0.0884 - binary_accuracy: 0.9699 - val_loss: 0.0924 - val_binary_accuracy: 0.9683

Epoch 00002: val_loss improved from 0.09251771 to 0.09243723, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 3/10
 - 7875s - loss: 0.0879 - binary_accuracy: 0.9700 - val_loss: 0.0910 - val_binary_accuracy: 0.9696

Epoch 00003: val_loss improved from 0.09243723 to 0.09104780, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 4/10
 - 5697s - loss: 0.0874 - binary_accuracy: 0.9702 - val_loss: 0.0875 - val_binary_accuracy: 0.9711

Epoch 00004: val_loss improved from 0.09104780 to 0.08749140, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 5/10
 - 6858s - loss: 0.0870 - binary_accuracy: 0.9704 - val_loss: 0.0937 - val_binary_accuracy: 0.9691

Epoch 00005: val_loss did not improve from 0.08749140
Epoch 6/10
 - 7010s - loss: 0.0863 - binary_accuracy: 0.9706 - val_loss: 0.0873 - val_binary_accuracy: 0.9710

Epoch 00006: val_loss improved from 0.08749140 to 0.08732716, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 7/10
 - 6933s - loss: 0.0861 - binary_accuracy: 0.9706 - val_loss: 0.0891 - val_binary_accuracy: 0.9706

Epoch 00007: val_loss did not improve from 0.08732716
Epoch 8/10
 - 6816s - loss: 0.0857 - binary_accuracy: 0.9707 - val_loss: 0.0944 - val_binary_accuracy: 0.9660

Epoch 00008: val_loss did not improve from 0.08732716
Epoch 9/10
 - 6868s - loss: 0.0856 - binary_accuracy: 0.9709 - val_loss: 0.0870 - val_binary_accuracy: 0.9708

Epoch 00009: val_loss improved from 0.08732716 to 0.08701316, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_1.h5
Epoch 10/10


PS:

Read file <./cluster_err/ResNet34_KFold_1_err.txt> for stderr output of this job.

