Sender: LSF System <lsfadmin@lng01>
Subject: Job 46185848: <ResNet34_KFold_2> in cluster <rcc> Exited

Job <ResNet34_KFold_2> was submitted from host <login-g> by user <rs619065> in cluster <rcc> at Wed Dec 12 10:56:09 2018
Job was executed on host(s) <lng01>, in queue <jara-clx>, as user <rs619065> in cluster <rcc> at Sun Dec 16 23:44:04 2018
</home/rs619065> was used as the home directory.
</home/rs619065/HPAIC/src> was used as the working directory.
Started at Sun Dec 16 23:44:04 2018
Terminated at Tue Dec 18 17:07:20 2018
Results reported at Tue Dec 18 17:07:20 2018

Your job looked like:

------------------------------------------------------------
# LSBATCH: User input
./train.zsh ResNet34 2
------------------------------------------------------------

TERM_OWNER: job killed by owner.
Exited with exit code 143.

Resource usage summary:

    CPU time :                                   581397.00 sec.
    Max Memory :                                 42017 MB
    Average Memory :                             37711.84 MB
    Total Requested Memory :                     102400.00 MB
    Delta Memory :                               60383.00 MB
    Max Swap :                                   2 MB
    Max Processes :                              37
    Max Threads :                                874
    Run time :                                   148995 sec.
    Turnaround time :                            540671 sec.

The output (if any) follows:

__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
data (InputLayer)               (None, 1024, 1024, 3 0                                            
__________________________________________________________________________________________________
conv1_pad (ZeroPadding2D)       (None, 1030, 1030, 3 0           data[0][0]                       
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 512, 512, 64) 9472        conv1_pad[0][0]                  
__________________________________________________________________________________________________
bn_conv1 (BatchNormalization)   (None, 512, 512, 64) 256         conv1[0][0]                      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 512, 512, 64) 0           bn_conv1[0][0]                   
__________________________________________________________________________________________________
pool1_pad (ZeroPadding2D)       (None, 514, 514, 64) 0           activation_1[0][0]               
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 256, 256, 64) 0           pool1_pad[0][0]                  
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 256, 256, 64) 36928       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 256, 256, 64) 256         res2a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 256, 256, 64) 0           bn2a_branch2a[0][0]              
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 256, 256, 64) 36928       activation_2[0][0]               
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, 256, 256, 64) 36928       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 256, 256, 64) 256         res2a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 256, 256, 64) 0           bn2a_branch2b[0][0]              
__________________________________________________________________________________________________
bn2a_branch1 (BatchNormalizatio (None, 256, 256, 64) 256         res2a_branch1[0][0]              
__________________________________________________________________________________________________
add_1 (Add)                     (None, 256, 256, 64) 0           activation_3[0][0]               
                                                                 bn2a_branch1[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 256, 256, 64) 0           add_1[0][0]                      
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 256, 256, 64) 36928       activation_4[0][0]               
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 256, 256, 64) 256         res2b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 256, 256, 64) 0           bn2b_branch2a[0][0]              
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 256, 256, 64) 36928       activation_5[0][0]               
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 256, 256, 64) 256         res2b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 256, 256, 64) 0           bn2b_branch2b[0][0]              
__________________________________________________________________________________________________
add_2 (Add)                     (None, 256, 256, 64) 0           activation_6[0][0]               
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 256, 256, 64) 0           add_2[0][0]                      
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 256, 256, 64) 36928       activation_7[0][0]               
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 256, 256, 64) 256         res2c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 256, 256, 64) 0           bn2c_branch2a[0][0]              
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 256, 256, 64) 36928       activation_8[0][0]               
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 256, 256, 64) 256         res2c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 256, 256, 64) 0           bn2c_branch2b[0][0]              
__________________________________________________________________________________________________
add_3 (Add)                     (None, 256, 256, 64) 0           activation_9[0][0]               
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 256, 256, 64) 0           add_3[0][0]                      
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 128, 128, 128 73856       activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 128, 128, 128 512         res3a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 128, 128, 128 0           bn3a_branch2a[0][0]              
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 128, 128, 128 147584      activation_11[0][0]              
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 128, 128, 128 73856       activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 128, 128, 128 512         res3a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 128, 128, 128 0           bn3a_branch2b[0][0]              
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 128, 128, 128 512         res3a_branch1[0][0]              
__________________________________________________________________________________________________
add_4 (Add)                     (None, 128, 128, 128 0           activation_12[0][0]              
                                                                 bn3a_branch1[0][0]               
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 128, 128, 128 0           add_4[0][0]                      
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 128, 128, 128 147584      activation_13[0][0]              
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 128, 128, 128 512         res3b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 128, 128, 128 0           bn3b_branch2a[0][0]              
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 128, 128, 128 147584      activation_14[0][0]              
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 128, 128, 128 512         res3b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 128, 128, 128 0           bn3b_branch2b[0][0]              
__________________________________________________________________________________________________
add_5 (Add)                     (None, 128, 128, 128 0           activation_15[0][0]              
                                                                 activation_13[0][0]              
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 128, 128, 128 0           add_5[0][0]                      
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 128, 128, 128 147584      activation_16[0][0]              
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 128, 128, 128 512         res3c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 128, 128, 128 0           bn3c_branch2a[0][0]              
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 128, 128, 128 147584      activation_17[0][0]              
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 128, 128, 128 512         res3c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 128, 128, 128 0           bn3c_branch2b[0][0]              
__________________________________________________________________________________________________
add_6 (Add)                     (None, 128, 128, 128 0           activation_18[0][0]              
                                                                 activation_16[0][0]              
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 128, 128, 128 0           add_6[0][0]                      
__________________________________________________________________________________________________
res3d_branch2a (Conv2D)         (None, 128, 128, 128 147584      activation_19[0][0]              
__________________________________________________________________________________________________
bn3d_branch2a (BatchNormalizati (None, 128, 128, 128 512         res3d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 128, 128, 128 0           bn3d_branch2a[0][0]              
__________________________________________________________________________________________________
res3d_branch2b (Conv2D)         (None, 128, 128, 128 147584      activation_20[0][0]              
__________________________________________________________________________________________________
bn3d_branch2b (BatchNormalizati (None, 128, 128, 128 512         res3d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 128, 128, 128 0           bn3d_branch2b[0][0]              
__________________________________________________________________________________________________
add_7 (Add)                     (None, 128, 128, 128 0           activation_21[0][0]              
                                                                 activation_19[0][0]              
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 128, 128, 128 0           add_7[0][0]                      
__________________________________________________________________________________________________
res4a_branch2a (Conv2D)         (None, 64, 64, 256)  295168      activation_22[0][0]              
__________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 64, 64, 256)  0           bn4a_branch2a[0][0]              
__________________________________________________________________________________________________
res4a_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_23[0][0]              
__________________________________________________________________________________________________
res4a_branch1 (Conv2D)          (None, 64, 64, 256)  295168      activation_22[0][0]              
__________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 64, 64, 256)  0           bn4a_branch2b[0][0]              
__________________________________________________________________________________________________
bn4a_branch1 (BatchNormalizatio (None, 64, 64, 256)  1024        res4a_branch1[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 64, 64, 256)  0           activation_24[0][0]              
                                                                 bn4a_branch1[0][0]               
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 64, 64, 256)  0           add_8[0][0]                      
__________________________________________________________________________________________________
res4b_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_25[0][0]              
__________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 64, 64, 256)  0           bn4b_branch2a[0][0]              
__________________________________________________________________________________________________
res4b_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_26[0][0]              
__________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 64, 64, 256)  0           bn4b_branch2b[0][0]              
__________________________________________________________________________________________________
add_9 (Add)                     (None, 64, 64, 256)  0           activation_27[0][0]              
                                                                 activation_25[0][0]              
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 64, 64, 256)  0           add_9[0][0]                      
__________________________________________________________________________________________________
res4c_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_28[0][0]              
__________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 64, 64, 256)  0           bn4c_branch2a[0][0]              
__________________________________________________________________________________________________
res4c_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_29[0][0]              
__________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 64, 64, 256)  0           bn4c_branch2b[0][0]              
__________________________________________________________________________________________________
add_10 (Add)                    (None, 64, 64, 256)  0           activation_30[0][0]              
                                                                 activation_28[0][0]              
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 64, 64, 256)  0           add_10[0][0]                     
__________________________________________________________________________________________________
res4d_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_31[0][0]              
__________________________________________________________________________________________________
bn4d_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 64, 64, 256)  0           bn4d_branch2a[0][0]              
__________________________________________________________________________________________________
res4d_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_32[0][0]              
__________________________________________________________________________________________________
bn4d_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 64, 64, 256)  0           bn4d_branch2b[0][0]              
__________________________________________________________________________________________________
add_11 (Add)                    (None, 64, 64, 256)  0           activation_33[0][0]              
                                                                 activation_31[0][0]              
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 64, 64, 256)  0           add_11[0][0]                     
__________________________________________________________________________________________________
res4e_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_34[0][0]              
__________________________________________________________________________________________________
bn4e_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4e_branch2a[0][0]             
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 64, 64, 256)  0           bn4e_branch2a[0][0]              
__________________________________________________________________________________________________
res4e_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_35[0][0]              
__________________________________________________________________________________________________
bn4e_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4e_branch2b[0][0]             
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 64, 64, 256)  0           bn4e_branch2b[0][0]              
__________________________________________________________________________________________________
add_12 (Add)                    (None, 64, 64, 256)  0           activation_36[0][0]              
                                                                 activation_34[0][0]              
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 64, 64, 256)  0           add_12[0][0]                     
__________________________________________________________________________________________________
res4f_branch2a (Conv2D)         (None, 64, 64, 256)  590080      activation_37[0][0]              
__________________________________________________________________________________________________
bn4f_branch2a (BatchNormalizati (None, 64, 64, 256)  1024        res4f_branch2a[0][0]             
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 64, 64, 256)  0           bn4f_branch2a[0][0]              
__________________________________________________________________________________________________
res4f_branch2b (Conv2D)         (None, 64, 64, 256)  590080      activation_38[0][0]              
__________________________________________________________________________________________________
bn4f_branch2b (BatchNormalizati (None, 64, 64, 256)  1024        res4f_branch2b[0][0]             
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 64, 64, 256)  0           bn4f_branch2b[0][0]              
__________________________________________________________________________________________________
add_13 (Add)                    (None, 64, 64, 256)  0           activation_39[0][0]              
                                                                 activation_37[0][0]              
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 64, 64, 256)  0           add_13[0][0]                     
__________________________________________________________________________________________________
res5a_branch2a (Conv2D)         (None, 32, 32, 512)  1180160     activation_40[0][0]              
__________________________________________________________________________________________________
bn5a_branch2a (BatchNormalizati (None, 32, 32, 512)  2048        res5a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 32, 32, 512)  0           bn5a_branch2a[0][0]              
__________________________________________________________________________________________________
res5a_branch2b (Conv2D)         (None, 32, 32, 512)  2359808     activation_41[0][0]              
__________________________________________________________________________________________________
res5a_branch1 (Conv2D)          (None, 32, 32, 512)  1180160     activation_40[0][0]              
__________________________________________________________________________________________________
bn5a_branch2b (BatchNormalizati (None, 32, 32, 512)  2048        res5a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_42 (Activation)      (None, 32, 32, 512)  0           bn5a_branch2b[0][0]              
__________________________________________________________________________________________________
bn5a_branch1 (BatchNormalizatio (None, 32, 32, 512)  2048        res5a_branch1[0][0]              
__________________________________________________________________________________________________
add_14 (Add)                    (None, 32, 32, 512)  0           activation_42[0][0]              
                                                                 bn5a_branch1[0][0]               
__________________________________________________________________________________________________
activation_43 (Activation)      (None, 32, 32, 512)  0           add_14[0][0]                     
__________________________________________________________________________________________________
res5b_branch2a (Conv2D)         (None, 32, 32, 512)  2359808     activation_43[0][0]              
__________________________________________________________________________________________________
bn5b_branch2a (BatchNormalizati (None, 32, 32, 512)  2048        res5b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_44 (Activation)      (None, 32, 32, 512)  0           bn5b_branch2a[0][0]              
__________________________________________________________________________________________________
res5b_branch2b (Conv2D)         (None, 32, 32, 512)  2359808     activation_44[0][0]              
__________________________________________________________________________________________________
bn5b_branch2b (BatchNormalizati (None, 32, 32, 512)  2048        res5b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_45 (Activation)      (None, 32, 32, 512)  0           bn5b_branch2b[0][0]              
__________________________________________________________________________________________________
add_15 (Add)                    (None, 32, 32, 512)  0           activation_45[0][0]              
                                                                 activation_43[0][0]              
__________________________________________________________________________________________________
activation_46 (Activation)      (None, 32, 32, 512)  0           add_15[0][0]                     
__________________________________________________________________________________________________
res5c_branch2a (Conv2D)         (None, 32, 32, 512)  2359808     activation_46[0][0]              
__________________________________________________________________________________________________
bn5c_branch2a (BatchNormalizati (None, 32, 32, 512)  2048        res5c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_47 (Activation)      (None, 32, 32, 512)  0           bn5c_branch2a[0][0]              
__________________________________________________________________________________________________
res5c_branch2b (Conv2D)         (None, 32, 32, 512)  2359808     activation_47[0][0]              
__________________________________________________________________________________________________
bn5c_branch2b (BatchNormalizati (None, 32, 32, 512)  2048        res5c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_48 (Activation)      (None, 32, 32, 512)  0           bn5c_branch2b[0][0]              
__________________________________________________________________________________________________
add_16 (Add)                    (None, 32, 32, 512)  0           activation_48[0][0]              
                                                                 activation_46[0][0]              
__________________________________________________________________________________________________
activation_49 (Activation)      (None, 32, 32, 512)  0           add_16[0][0]                     
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 64)           0           res2a_branch1[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_3 (Glo (None, 128)          0           res3a_branch1[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_4 (Glo (None, 256)          0           res4a_branch1[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_5 (Glo (None, 512)          0           res5a_branch1[0][0]              
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 512)          0           activation_49[0][0]              
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 1472)         0           global_average_pooling2d_2[0][0] 
                                                                 global_average_pooling2d_3[0][0] 
                                                                 global_average_pooling2d_4[0][0] 
                                                                 global_average_pooling2d_5[0][0] 
                                                                 global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
fc1 (Dense)                     (None, 512)          754176      concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_1 (BatchNormalization)    (None, 512)          2048        fc1[0][0]                        
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 512)          0           batch_1[0][0]                    
__________________________________________________________________________________________________
fc2 (Dense)                     (None, 512)          262656      dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_2 (BatchNormalization)    (None, 512)          2048        fc2[0][0]                        
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 512)          0           batch_2[0][0]                    
__________________________________________________________________________________________________
fc28 (Dense)                    (None, 28)           14364       dropout_2[0][0]                  
==================================================================================================
Total params: 23,758,940
Trainable params: 23,739,740
Non-trainable params: 19,200
__________________________________________________________________________________________________
Training model on 84511 samples, validate on 21166 samples
Epoch 1/100
Epoch 1/100
 - 5748s - loss: 0.3239 - binary_accuracy: 0.8655 - val_loss: 0.1579 - val_binary_accuracy: 0.9518

Epoch 00001: val_loss improved from inf to 0.15789160, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_2.h5
Epoch 2/100
 - 6304s - loss: 0.1534 - binary_accuracy: 0.9507 - val_loss: 0.1381 - val_binary_accuracy: 0.9570

Epoch 00002: val_loss improved from 0.15789160 to 0.13805843, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_2.h5
Epoch 3/100
 - 5900s - loss: 0.1364 - binary_accuracy: 0.9553 - val_loss: 0.1262 - val_binary_accuracy: 0.9580

Epoch 00003: val_loss improved from 0.13805843 to 0.12619709, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_2.h5
Epoch 4/100
 - 5901s - loss: 0.1258 - binary_accuracy: 0.9584 - val_loss: 0.1235 - val_binary_accuracy: 0.9570

Epoch 00004: val_loss improved from 0.12619709 to 0.12346143, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_2.h5
Epoch 5/100
 - 5892s - loss: 0.1192 - binary_accuracy: 0.9603 - val_loss: 0.1216 - val_binary_accuracy: 0.9624

Epoch 00005: val_loss improved from 0.12346143 to 0.12155553, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_2.h5
Epoch 6/100
 - 6117s - loss: 0.1150 - binary_accuracy: 0.9615 - val_loss: 0.1121 - val_binary_accuracy: 0.9628

Epoch 00006: val_loss improved from 0.12155553 to 0.11209472, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_2.h5
Epoch 7/100
 - 5869s - loss: 0.1125 - binary_accuracy: 0.9622 - val_loss: 0.1093 - val_binary_accuracy: 0.9635

Epoch 00007: val_loss improved from 0.11209472 to 0.10926474, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_2.h5
Epoch 8/100
 - 5969s - loss: 0.1100 - binary_accuracy: 0.9630 - val_loss: 0.1432 - val_binary_accuracy: 0.9571

Epoch 00008: val_loss did not improve from 0.10926474
Epoch 9/100
 - 6124s - loss: 0.1079 - binary_accuracy: 0.9637 - val_loss: 0.1235 - val_binary_accuracy: 0.9616

Epoch 00009: val_loss did not improve from 0.10926474
Epoch 10/100
 - 6098s - loss: 0.1062 - binary_accuracy: 0.9643 - val_loss: 0.1112 - val_binary_accuracy: 0.9601

Epoch 00010: val_loss did not improve from 0.10926474
Epoch 11/100
 - 5892s - loss: 0.1050 - binary_accuracy: 0.9646 - val_loss: 0.1074 - val_binary_accuracy: 0.9650

Epoch 00011: val_loss improved from 0.10926474 to 0.10741403, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_2.h5
Epoch 12/100
 - 6094s - loss: 0.1040 - binary_accuracy: 0.9649 - val_loss: 0.1140 - val_binary_accuracy: 0.9635

Epoch 00012: val_loss did not improve from 0.10741403
Epoch 13/100
 - 6602s - loss: 0.1032 - binary_accuracy: 0.9652 - val_loss: 0.1049 - val_binary_accuracy: 0.9658

Epoch 00013: val_loss improved from 0.10741403 to 0.10494394, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_2.h5
Epoch 14/100
 - 6281s - loss: 0.1024 - binary_accuracy: 0.9655 - val_loss: 0.1260 - val_binary_accuracy: 0.9631

Epoch 00014: val_loss did not improve from 0.10494394
Epoch 15/100
 - 6000s - loss: 0.1016 - binary_accuracy: 0.9657 - val_loss: 0.1058 - val_binary_accuracy: 0.9658

Epoch 00015: val_loss did not improve from 0.10494394
Epoch 16/100
 - 6230s - loss: 0.1008 - binary_accuracy: 0.9660 - val_loss: 0.1142 - val_binary_accuracy: 0.9603

Epoch 00016: val_loss did not improve from 0.10494394
Epoch 17/100
 - 5963s - loss: 0.1002 - binary_accuracy: 0.9663 - val_loss: 0.0976 - val_binary_accuracy: 0.9682

Epoch 00017: val_loss improved from 0.10494394 to 0.09763116, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_2.h5
Epoch 18/100
 - 6010s - loss: 0.0998 - binary_accuracy: 0.9664 - val_loss: 0.0992 - val_binary_accuracy: 0.9677

Epoch 00018: val_loss did not improve from 0.09763116
Epoch 19/100
 - 5961s - loss: 0.0994 - binary_accuracy: 0.9666 - val_loss: 0.1011 - val_binary_accuracy: 0.9670

Epoch 00019: val_loss did not improve from 0.09763116
Epoch 20/100
 - 6042s - loss: 0.0988 - binary_accuracy: 0.9668 - val_loss: 0.1002 - val_binary_accuracy: 0.9653

Epoch 00020: val_loss did not improve from 0.09763116
Epoch 21/100
 - 5913s - loss: 0.0984 - binary_accuracy: 0.9669 - val_loss: 0.1002 - val_binary_accuracy: 0.9671

Epoch 00021: val_loss did not improve from 0.09763116
Epoch 22/100
 - 6072s - loss: 0.0978 - binary_accuracy: 0.9671 - val_loss: 0.1065 - val_binary_accuracy: 0.9652

Epoch 00022: val_loss did not improve from 0.09763116
Epoch 23/100
 - 6026s - loss: 0.0974 - binary_accuracy: 0.9673 - val_loss: 0.0970 - val_binary_accuracy: 0.9674

Epoch 00023: val_loss improved from 0.09763116 to 0.09702752, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_2.h5
Epoch 24/100
 - 5935s - loss: 0.0970 - binary_accuracy: 0.9674 - val_loss: 0.1013 - val_binary_accuracy: 0.9655

Epoch 00024: val_loss did not improve from 0.09702752
Epoch 25/100


PS:

Read file <./cluster_err/ResNet34_KFold_2_err.txt> for stderr output of this job.

Sender: LSF System <lsfadmin@lng02>
Subject: Job 46244560: <ResNet34_KFold_2> in cluster <rcc> Exited

Job <ResNet34_KFold_2> was submitted from host <login-g> by user <rs619065> in cluster <rcc> at Thu Dec 20 16:14:17 2018
Job was executed on host(s) <lng02>, in queue <jara-clx>, as user <rs619065> in cluster <rcc> at Thu Dec 20 18:07:25 2018
</home/rs619065> was used as the home directory.
</home/rs619065/HPAIC/src> was used as the working directory.
Started at Thu Dec 20 18:07:25 2018
Terminated at Fri Dec 21 11:53:00 2018
Results reported at Fri Dec 21 11:53:00 2018

Your job looked like:

------------------------------------------------------------
# LSBATCH: User input
./train.zsh ResNet34 2
------------------------------------------------------------

TERM_OWNER: job killed by owner.
Exited with exit code 143.

Resource usage summary:

    CPU time :                                   186515.00 sec.
    Max Memory :                                 37626 MB
    Average Memory :                             30747.84 MB
    Total Requested Memory :                     60000.00 MB
    Delta Memory :                               22374.00 MB
    Max Swap :                                   2 MB
    Max Processes :                              21
    Max Threads :                                473
    Run time :                                   63935 sec.
    Turnaround time :                            70723 sec.

The output (if any) follows:

Training model on 84511 samples, validate on 21166 samples
Epoch 1/10
 - 7092s - loss: 0.0888 - binary_accuracy: 0.9696 - val_loss: 0.0894 - val_binary_accuracy: 0.9702

Epoch 00001: val_loss improved from 0.09702752 to 0.08942396, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_2.h5
Epoch 2/10
 - 7267s - loss: 0.0881 - binary_accuracy: 0.9698 - val_loss: 0.0968 - val_binary_accuracy: 0.9657

Epoch 00002: val_loss did not improve from 0.08942396
Epoch 3/10
 - 6789s - loss: 0.0874 - binary_accuracy: 0.9701 - val_loss: 0.1004 - val_binary_accuracy: 0.9669

Epoch 00003: val_loss did not improve from 0.08942396
Epoch 4/10
 - 6415s - loss: 0.0869 - binary_accuracy: 0.9703 - val_loss: 0.0915 - val_binary_accuracy: 0.9696

Epoch 00004: val_loss did not improve from 0.08942396
Epoch 5/10
 - 8512s - loss: 0.0865 - binary_accuracy: 0.9704 - val_loss: 0.0940 - val_binary_accuracy: 0.9660

Epoch 00005: val_loss did not improve from 0.08942396
Epoch 6/10
 - 7059s - loss: 0.0861 - binary_accuracy: 0.9706 - val_loss: 0.0845 - val_binary_accuracy: 0.9719

Epoch 00006: val_loss improved from 0.08942396 to 0.08450453, saving model to /home/rs619065/HPAIC/model/ResNet34/ResNet34_KFold_2.h5
Epoch 7/10
 - 6909s - loss: 0.0858 - binary_accuracy: 0.9706 - val_loss: 0.0884 - val_binary_accuracy: 0.9703

Epoch 00007: val_loss did not improve from 0.08450453
Epoch 8/10
 - 6930s - loss: 0.0853 - binary_accuracy: 0.9709 - val_loss: 0.0846 - val_binary_accuracy: 0.9716

Epoch 00008: val_loss did not improve from 0.08450453
Epoch 9/10


PS:

Read file <./cluster_err/ResNet34_KFold_2_err.txt> for stderr output of this job.

